мояработа/src/Documents/РеализацияТоваров/РеализацияТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваров</name>
  <basedOn>Document.ПоступлениеТоваров</basedOn>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

мояработа/src/Documents/РеализацияТоваров/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр ОстаткиТоваров
	Перем ДанныеЗаполнения;
	Движения.ОстаткиТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаТовары из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ

//Процедура ОбработкаЗаполнения(ДанныеЗаполнения,СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	//@skip-warning
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваров") Тогда
		// Заполнение шапки
		Контрагент = ДанныеЗаполнения.Контрагент;
		Ответственный = ДанныеЗаполнения.Ответственный;

		Для Каждого ТекСтрокаТовары из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.Цена = ТекСтрокаТовары.Цена;
			НоваяСтрока.Сумма = ТекСтрокаТовары.Сумма;
		КонецЦикла;
	КонецЕсли;

	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ

КонецПроцедуры
